#+setupfile: ~/COMM/public_html/org-html-theme/index-bigblow-header.setup
#+include: ~/COMM/Lects/meta-ruby/site/info/common-header.org
#+title: rubylife 練習ノート

[[http://libro.tuyano.com/index2?id=953003][ビギナーのためのRubyプログラミング入門]]

** Rubyを動かしてみる!

#+BEGIN_SRC sh 
ruby
#+END_SRC

#+RESULTS:

これでRuby (インタプリター) が起動し, ここで、Rubyのスクリプトを書くと、そ
れがこの場で実行できるのです。

では、以下のようにタイプしてみてください。１行ずつ書いてはEnterして記述をしましょう。

#+BEGIN_SRC ruby :results output 
a = 10
b = 20
c = 30
result = (a + b) * c
puts("答え：" + result.to_s)
#+END_SRC

#+RESULTS:
: 答え：900

Rubyなどの言語では、その言語で書かれたプログラムリストのことを「スクリ
プト」と呼びます。

スクリプトを実行する、それが言語の役目ですね。

スクリプトを書いたら、Ctrlキーを押したままの状態で「D」キーを押します。

次は，Rubyのインタプリタ irb を使ってみます。

#+BEGIN_SRC sh :results output 

irb <<END
a = 10
b = 20
c = 30
result = (a + b) * c
puts("答え：" + result.to_s)
END
#+END_SRC

#+RESULTS:
#+begin_example
Switch to inspect mode.
a = 10
10
b = 20
20
c = 30
\30
result = (a + b) * c
900
puts("答え：" + result.to_s)
答え：900
nil

#+end_example

** case文

#+BEGIN_SRC ruby :results output :session case
# coding: utf-8 
a = 8
case a
when 1..2
    puts('winter')
when 3..5
    puts('spring')
when 6..8
    puts('summer')
when 9..11
    puts('autumn')
when 12
    puts('last month')
else
    puts('something wrong')
end
#+END_SRC

#+RESULTS:
: 8
: summer

： 1..2, 3..5, ...  範囲 [[http://docs.ruby-lang.org/ja/1.9.3/class/Range.html][class Range (Ruby 1.9.3)]]

** while文

#+BEGIN_SRC ruby :results output :session while
a = 100
x = 0
y = 0
puts(a.to_s + "までの合計")
while  x <= a
    y += x
    x += 1
end
puts(y)
#+END_SRC

#+RESULTS:
: 100
: 0
: 0
: 100までの合計
: nil
: nil
: 5050

: a.to_s オブジェクトを文字列にする

#+BEGIN_SRC ruby :session while :results output
a = 12300
x = a
y = 2
puts(a.to_s + "の素因数")
while  true
    if  x % y == 0 then
        x /= y
        puts(y)
    else
        y += 1
    end
    if x / 2 < y then
        break
    end
end
if x > 1 then
    puts(x)
end

#+END_SRC

#+RESULTS:
#+begin_example
12300
12300
2
12300の素因数
nil
2
2
3
5
5
nil
41
#+end_example


*** 配列の作成

    配列は値の列で，添字で列の要素にアクセスできます。

    : Array.new
    : Array.new( 数 )
    : [値1, 値2, ……]

#+BEGIN_SRC ruby :results output
p Array.new
p Array.new(10)
p [1,2,3,4]
p [1,2,3,4][0]
p [1,2,3,4][1]
p [1,2,3,4][2]
p [1,2,3,4][3]
#+END_SRC

#+RESULTS:
: []
: [nil, nil, nil, nil, nil, nil, nil, nil, nil, nil]
: [1, 2, 3, 4]
: 1
: 2
: 3
: 4

*** 配列と「for」構文

    全部の値をまとめて処理する場合

: for 変数 in 配列
:    ……繰り返す処理……
: end


#+BEGIN_SRC ruby :results output
arr = [10, 20, 30, 40, 50]
total = 0
for item in arr
    total += item
end
puts(total)

## おまけ

total = 0
arr.each { |val| total = total + val }
puts(total)

total = arr.inject(0) { |total,val| total+val }
puts(total)

total = arr.inject(0,:+) 
puts(total)

#+END_SRC

#+RESULTS:
: 150
: 150
: 150
: 150

*** ハッシュの作成

    ： Hash.new
    ： { キー1 => 値1 , キー2 => 値2 , ……}

#+BEGIN_SRC ruby :session ruby :results output

hash = Hash.new(0)

hash['key'] = 'value'

hash

'end'
#+END_SRC

#+RESULTS:
: {}
: "value"
: {"key"=>"value"}


*** eachによる繰り返し処理

    配列やハッシュは、for以外にも実はいろいろな形で利用する機能を備え
    ています。配列やハッシュは、「オブジェクト」と呼ばれる値であり、そ
    れらの中に用意されている「メソッド」という機能を呼び出すことで、い
    ろいろな処理が実行できるのです。

    オブジェクトについてはいずれ改めて説明するとして、ここでは配列／ハッ
    シュの要素を処理する「each」というメソッドを紹介しておくことにしま
    しょう。

    : 配列 .each do | 変数 |
    :   ……実行する処理……
    : end


    : ハッシュ .each do | 変数1, 変数2 |
    :  ……実行する処理……
    : end

    eachは、配列／ハッシュのオブジェクトの中にある機能です。これは、配
    列／ハッシュが保管されている変数名の後にドットを付け、続けて「each」
    と記述します。その後に、do | 変数 |と記述します。変数の前後にある|
    は、必ず付けないといけません。

    配列の場合、取り出された値が変数に設定されていきます。ハッシュの場
    合は、取り出した項目のキーと値がそれぞれ別々に変数に設定されます。

    下に簡単な利用例を挙げておきましょう。配列arrから順に値を取り出し
    て表示するだけの簡単なものですが、eachの働きがよく分かるでしょう。

    このeachもfor構文も、基本的には「保管された要素を順番に取り出して
    変数に設定し、繰り返しを行う」という点に変わりはありません。まぁ、
    ビギナーのうちは、どちらか一方だけ知っていればOKと考えていいでしょ
    う。

#+BEGIN_SRC ruby :session ruby :results output

arr = [10, 20, 30, 40, 50]
arr.each do |item|
    puts(item)
end

#+END_SRC

#+RESULTS:
: [10, 20, 30, 40, 50]
: 10
: 20
: 30
: 40
: 50

** map
#+BEGIN_SRC ruby :session ruby :results output

arr.map { |val| val+1 }

'end'

#+END_SRC

#+RESULTS:
: [11, 21, 31, 41, 51]

#+BEGIN_SRC ruby :session ruby :results output

hash = { 'a'=> 1, 'b' => 2}

new_hash = hash.map { |k,v|  k => v } 


'end'

#+END_SRC

#+RESULTS:
: {"a"=>1, "b"=>2}
: SyntaxError: (irb):585: syntax error, unexpected =>, expecting '}'
: new_hash = hash.map { |k,v|  k => v } 
:                                  ^
: 	from /opt/local/bin/irb:13:in `<main>'


#+BEGIN_SRC ruby :session ruby :results output
'a' => 1
'end'
#+END_SRC

#+RESULTS:
: SyntaxError: (irb):591: syntax error, unexpected =>, expecting end-of-input
: 'a' => 1
:       ^
: 	from /opt/local/bin/irb:13:in `<main>'


